import requests
citis = [
    'Абакан',
    'Абу-Даби',
    'Алматы',
    'Амман',
    'Амстердам',
    'Анапа',
    'Анкара',
    'Антверпен',
    'Архангельск',
    'Астана',
    'Астрахань',
    'Афины',
    'Баку',
    'Бангкок',
    'Барселона',
    'Берлин',
    'Братислава',
    'Брюгге',
    'Брюссель',
    'Бухарест',
    'Буэнос-Айрес',
    'Варна',
    'Варшава',
    'Вашингтон',
    'Вена',
    'Венеция',
    'Вильнюс',
    'Волгоград',
    'Гавана',
    'Гагра',
    'Гамбург',
    'Геленджик',
    'Гонконг',
    'Дели',
    'Днепр',
    'Дрезден',
    'Дубай',
    'Евпатория',
    'Ейск',
    'Екатеринбург',
    'Елабуга',
    'Ереван',
    'Ессентуки',
    'Женева',
    'Загреб',
    'Иерусалим',
    'Измир',
    'Йошкар-Ола',
    'Казань',
    'Каир',
    'Канны',
    'Карловы Вары',
    'Кёльн',
    'Керчь',
    'Киев',
    'Копенгаген',
    'Кронштадт',
    'Лас-Вегас',
    'Лондон',
    'Мадрид',
    'Майами-Бич',
    'Марсель',
    'Милан',
    'Минеральные Воды',
    'Минск',
    'Москва',
    'Мюнхен',
    'Набережные Челны',
    'Нарва',
    'Нижний Новгород',
    'Никосия',
    'Ницца',
    'Новосибирск',
	'Новокузнецк',
    'Нур-Султан',
    'Нью-Дели',
    'Нью-Йорк',
    'Одесса',
    'Омск',
    'Париж',
    'Пекин',
    'Пермь',
    'Прага',
    'Пятигорск',
    'Рабат',
    'Рига',
    'Рим',
    'Ростов-на-Дону',
    'Самара',
    'Санкт-Петербург',
    'Севастополь',
    'Сеул',
    'Сидней',
    'Сингапур',
    'Соль-Илецк',
    'София',
    'Сочи',
    'Стамбул',
    'Стокгольм',
    'Сухум',
    'Сан Франциско',
    'Таллин',
    'Тарту',
    'Ташкент',
    'Тбилиси',
    'Уфа',
    'Феодосия',
    'Флоренция',
    'Ханой',
    'Харьков',
    'Хельсинки',
    'Хошимин',
    'Цюрих',
    'Челябинск',
    'Штутгарт',
    'Щецин',
    'Эйлат',
    'Юрмала',
    'Ялта',
    'Тромсё',
    'Норильск',
    'Североморск',
    'Мурманск',
    'Апатиты',
    'Воркута',
    'Усть-Куйга',
    'Караул',
    'Чукочья',
    'Жилинда',
    'Прадхо-Бей',
    'Хаммерфест',
    'Хоннингсвог',
    'Гамвик',
    'Скарсвог',
    'Юрибей',
    'Порт-Алберни'
]


api_key = "ca532f2f510bb6a0360d385f4c19b384"										#Погода
base_url = "http://api.openweathermap.org/data/2.5/weather?"

n = ['Clouds', 'Clear', 'Rain', 'Snow', 'Dust', 'Haze', 'Thunderstorm', 'Fog', 'Mist', 'Drizzle', 'Squall', 'Smoke']

print('Типы погоды: ')
print('Clouds, Clear, Rain, Snow, Dust, Haze, Thunderstorm, Fog, Mist, Drizzle, Squall, Smoke')
while True:
    b = input('введите тип погоды: ')
    if b in n:
        print('щас поищем')
        answ = 0
        for city in citis:
            complete_url = base_url + "appid=" + api_key + "&q=" + city + '&lang=ru'
            response = requests.get(complete_url)
            try:
                description = response.json()["weather"][0]['description']
                main = response.json()["weather"][0]['main']
                if main == b:
                    print(f'{city}: main: {main}; description: {description}')
                    answ = 1
                    break
            except: pass

        if answ == 0: print('не получилось найти такую погоду')

    else: print('я такое не знаю')