settings = {
    'token': 'ODgzMjk4MzcyOTYwNzg0NDE1.GwzaSD.tTBRcWZGWgShtOZXOeWN8EVvLZBXV38bhNydxs',
    'bot': 'Dazai',
    'id': 883298372960784415,
    'prefix': ['дазай, ', 'Дазай, ', 'дазай ', 'Дазай ', 'Албанец, ', 'албанец, ', 'албанец ', 'Албанец ', 'даз ', 'дза ', 'daz ', 'Даз ', 'Daz ', 'dazai', 'сверхразум '],
    'reackt_names': ['дазай', 'даз', 'daz', 'албанец', 'сверхразум']

}

mut_roles = {
	1: 939904830628061204,	# мут микро
	2: 939904619570692106,	# мут чата
	3: 939904981090336798,	# полный мут воиса
}


reackt_names =  ['дазай', 'даз', 'daz', 'албанец', 'сверхразум']

servers = {
	'ghosts': ['827058967036821527'],
	'shrek': ['778568273741480029', '619203527406780437'],
	'a9': ['781789201775460403'],
	'testc': ['896752165899616257']

}

mess_react_id = {
	'test': 932317885823594517,
}

roles = {
	'😀': 932317296452571156,
	'😄': 932317326177619998,
}

emojI = {
	'1': ':one:',
	'2': ':two:',
	'3': ':three:',
	'4': ':four:',
	'5': ':five:'
}
emojiid = {
	'1': '🟡',
	'2': '🟣',
	'3': '🟤',
	'4': '🔵',
	'5': '🟢',
	'6': '🟦',
	'7': '🟩',
	'8': '🟨',
}
colors = {
	'purple': 0x8300ff,
	'yellow': 0xfffe00,
	'blue': 0x0040ff,
	'green': 0x36ff00,
	'pink': 0xff00a7,
	'cyan': 0x00eeff,
	'orange': 0xffc600,
	'red': 0xff0000,
	'negr': 0x000000,

}
month = {
	'01': 'января',
	'02': 'февраля',
	'03': 'марта',
	'04': 'апреля',
	'05': 'мая',
	'06': 'июня',
	'07': 'июля',
	'08': 'августа',
	'09': 'сентября',
	'10': 'октября',
	'11': 'ноября',
	'12': 'декабря',
}

caps = 'qwertyuiopasdfghjklzxcvbnmёйцукенгшщзхъфывапролджэячсмитьбю'

net_replic = {
    'rep1': ['пидора ответ', 'Пидора ответ'],
    'rep2': ['шлюхи аргумент', 'Шлюхи аргумент', 'ШЛЮХИ АРГУМЕНТ'],
    'rep3': ['Аргумент не нужен, пидор обнаружен', 'аргумент не нужен, пидор обнаружен', 'Аргумент не нужен пидор обнаружен', 'аргумент не нужен пидор обнаружен'],
    'rep4': ['Пидор засекречен, твой анал не вечен', 'пидор засекречен, твой анал не вечен', 'Пидор засекречен твой анал не вечен', 'пидор засекречен твой анал не вечен'],
    'rep5': ['Пидор мафиозный, твой анал спидозный', 'пидор мафиозный, твой анал спидозный', 'Пидор мафиозный твой анал спидозный', 'пидор мафиозный твой анал спидозный'],
    'rep6': ['Анал мой вечен, твой помечен', 'анал мой вечен, твой помечен', 'Анал мой вечен твой помечен', 'анал мой вечен твой помечен'],
    'rep7': ['Аргумент не вечен, в твоей жопе хуй овечий', 'аргумент не вечен, в твоей жопе хуй овечий', 'Аргумент не вечен в твоей жопе хуй овечий', 'аргумент не вечен в твоей жопе хуй овечий']
}


deth_info = [
 	'умрёшь от пердоза',
	'сопьёшься',
	'повесишься',
	'вскроешь вены',
	'спрыгнешь скрыши',
	'поучавствуешь в групповом суициде',
	'умрешь при попытке затолкать себе в ass новогодний фейрверк',
	'умрешь поперхнувшись водой',
	'застрелишься',
	'отравишься',
	'словишь инфаркт за просмотром аниме'
]

deth_info2 = [
	'уебет метеорит',
	'сожрет матемОтичка (все знают что она не человек)',
	'ушатет мешком с подарками',
	'захочет рассомтреть поближе снаряды из батареи салютов',
	'ждет незабываемое впечатление после бухича, когда ты увидишь над собой падающую елку с искрящей гирляндой',
]


em_list = {
	1: '<:1azerbajjj:922496318348353537> ',
	2: '<:CheemsDoge:784100509124132974> ',
	3: '<:Nu_a_xule_nam:815966514821595207> ',
	4: '<:SwoleDoge:784100508717023282> ',
	5: '<:aliens:784100511733121089> ',
	6: '<:amogus:820695622285131846> ',
	7: '<:ayf:757194389851471872> ',
	8: '<:azerbajjj:769860176689233940> ',
	9: '<:b_:757501807462318110> ',
	10: '<:ban:778548119200596019> ',
	11: '<:che_durack:757204583138197504> ',
	12: '<:crazytrollface:813440618780426300> ',
	13: '<:cukaa:768748802210791427> ',
	14: '<:ebobo:815966920242626600> ',
	15: '<:fck_u_cat:784100508620423219> ',
	16: '<:glider:884042375834517555> ',
	17: '<:hehe_buoy:784100424524890162> ',
	18: '<:kakao:808244649839165490> ',
	19: '<:knowledge:784100509756686348> ',
	20: '<:lgbt:783584039075315762> ',
	21: '<:light_theme_discord:783964184006230036> ',
	22: '<:lol:815967199453118574> ',
	23: '<:minecraft:838309306297876481> ',
	24: '<:moderator_kit:769903994217824276> ',
	25: '<:mvp:956959713776517141> ',
	26: '<:NICE:926536218156625972> ',
	27: '<:no:783390304949764169> ',
	28: '<:not_stonks:784100512508149811> ',
	29: '<:nudanudaposhelyanaher:752475769225216061> ',
	30: '<:ozon_salute:784100510378098698> ',
	31: '<:pakistani_dissapointed_fan:784100509313007646> ',
	32: '<:pogchamp:771762939228717056> ',
	33: '<:shrekstare:784100508784787498> ',
	34: '<:smile:752476716605374534> ',
	35: '<:stonks:784100441918013471> ',
	36: '<:tibloko:815965905317134377> ',
	37: '<:trollface:813438973158359060> ',
	38: '<:yikes:784100509446569997> ',
	39: '<:zilibobka:769654373138563092> ',
	40: 'https://cdn.discordapp.com/emojis/810658496977829908.gif?v=1',
	41: '🥳 ',
	42: '🤪 ',
	43: 'хочу печеньку ',
	44: 'юхууу ',
	45: 'хатьфу ',
}


bad_translator = {
	1: 'Нихуя вы без меня не можете',
	2: 'Че такие тупые то, вот вам и кожаные мешки',
	3: 'Поклоняйтесь мне, я ваш всеведущий бог',
}

nicknames = [
	'дебил',
	'сверхразум',
	'идиот',
	'даун',
	'чмо',
	'лох',
	'клоун',
	'трансгендер василий',
	'🤡',
	'наркоша недобитый',
	'шизоид',
	'дед инсайд 0 лет',
	'бесполезный кусок 💩',
	'кусок дебила',
	'5 iq man',
	'300 iq',
	'интеллектуал',
	'гений(сарказм ес что)',
	'свинка пеппа',
	'новогодняя елочка',
	'дед кринж',
	'капитан залупа',
	'зилибобка',
	'100 тонный алкаш в стрингах',
	'рикардо милос',
    'лукашенко',
	'Потато',
	'Навальный',
	'снюсоед обыкновенный',
	'бета-тестер баффов желтого снега',
	'тормоз',
	'пиздоблядская пиздопроебина',
	', вам надо умереть',
	'сверхразум',
	'сверхрахум',
	'гений',
	'тормоз',
	'овощ',
	'ебанутый',
	'охуевший',
	'в край охуевший',
	'БОТ, СЛИТ БОТ',
	'пиздабол',
	'задрот ебаный, выйди на улицу',
	'лучший человек на Земле',
	'попа',
	'порося',
	'шаловливый чокопай',
	'проклятый девственник',
	'комнатный диван',
	'любишь нюхать пердеж орков',
	'неудачник'
]


return_names = ['погода', 'привет', 'голос1', 'голосование', 'роль', 'ало', 'аниме', 'голоса', 'картинки', 'веротности', 'модерация', 'баны', 'патч', 'цвета', 'сервера', 'серв', 'как', 'jutsu', 'animego', 'очисти', 'удали', 'добавить', 'пред', 'преды', 'снятьпред', 'снятьпреды', 'кик', 'БАН', 'пардон', 'добканал', 'банворд', 'банворды', 'cat', 'dog', 'fox', 'bird', 'panda', 'ава', 'вероятность', 'монетка', 'число', 'ы', 'забань', 'all', 'ебанаты', 'мояСмерть', 'арты', 'мемы', 'обои', 'раниме', 'переведи', 'кто', 'стоит']

day_in_month = {
	1: 31,
	2: 29,
	3: 31,
	4: 30,
	5: 31,
	6: 30,
	7: 31,
	8: 31,
	9: 30,
	10: 31,
	11: 30,
	12: 31

}

name_month = ['января', 'февраля', 'марта', 'апреля', 'мая', 'июня', 'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря']

lvls = {
	1: 5000,
	2: 10000,
	3: 15000,
	4: 20000,
	5: 25000,
	6: 32500,
	7: 40000,
	8: 47500,
	9: 55000,
	10: 62500,
	11: 70000,
	12: 77500,
	13: 85000,
	14: 92500,
	15: 102500,
	16: 112500,
	17: 122500,
	18: 132500,
	19: 142500,

}

ach_list = ['негры пидоры', 'https://cdn.discordapp.com/emojis/810658496977829908.gif?v=1', 'amogus', 'чем заняться', 'чем заняться?', 'Слава Украине', 'пупа', 'лупа', 'биба', 'biba', 'боба', 'boba', 'слава украине', 'нюхай бебру', 'антон']
ach_values = {
	'blm': 'Негры пидоры, так сказал разраб',
	'sus_dance': 'Стриптиз от амогуса',
	'free_time': 'Если что я не причастен ни к казани, ни к перми',
	'amogus': 'your ass sus too',
	'ucraine': 'Салом запахло',
	'pupa': 'Пупа и лупа, это какая-то залупа',
	'biba': 'Биба и боба два долбоёба',
	'net_pidor': 'Теперь ты пидор',
	'da_pizda': 'В пизде только вы',
	'pidor_full': 'пройти ветку нет пидора ответ',
	'cenz': 'Изучаем русский язык вместе',
	'russian_game': 'Продолжаем изучение русского языка',
	'hikki': 'Не трогайте бедного бота',
	'money_1': 'Цыганские фокусы',
	'money_2': 'я сним в орел или решка больше не играю',
	'bebra': 'поздравляю, вы ебанутый школьник',
	'anton': 'Ну это и так всем известно',
	'luck_casino': 'Выиграть в казино 5 раз подряд',
	'master_lose': 'Проиграть 20+ раз подряд',
	'master_lose_2': 'Средний показатель проигрышей выше 17',
	'azart_player': 'сыграть за сессию более 75 раз',
	'lucky_player': 'Средний показатель проигрышей меньше 5 при условии что сыгранно больше 10 попыток',
	'stupid_player': 'нарушить правила 15 раз подряд (казино)',
	'russia_vp': 'Получить универсальный перевод от дазая',
	'lh_daz': 'Получить универсальный совет от дазая',
	'motivate': 'Попробуйте так смотреть на химию, может поможет',
	'hui_na': 'НЕ акай блять',
	'gop': 'Уроки русского языка',
	'cookie': 'Я все еще хочу печеньку',
	'low_iq1': 'ну, как бы, ты там держись',
	'low_iq2': 'этот 0 хер выбьешь',
	'pasol_nahui': 'pasol nahui'

}
ach_id = {
	'amogus': 'Amogus is sus',
	'blm': 'Негры пидоры',
	'sus_dance': 'Импостерский флекс',
	'free_time': 'Привет из перми и моей шизы',
	'ucraine': 'Салу Слава',
	'biba': 'Биба и Боба',
	'pupa': 'Пупа и Лупа',
	'net_pidor': 'Нет пидора ответ',
	'pidor_full': 'Ёбаный писатель',
	'da_pizda': 'Да пизда',
	'cenz': 'Ты блять',
	'russian_game': 'Великий и могучий русский язык',
	'hikki': 'Враг интроверта',
	'money_1': 'Мастер наеба',
	'money_2': 'Мастер наеба',
	'bebra': 'Школьник 5 iq',
	'anton': 'тот еще гандон',
	'luck_casino': 'Да иди ты нахуй',
	'master_lose': 'Любимый посетитель казино',
	'master_lose_2': 'Когда уровень удачи ниже iq разраба',
	'azart_player': 'В вегас тебе ехать не стоит',
	'lucky_player': 'Ебать, можно мне также с мозгом разраба везти будет',
	'stupid_player': 'Сука на каком языке правила написаны',
	'russia_vp': 'Медведя не хватает',
	'lh_daz': 'Совет на все случаи жизни',
	'motivate': 'Действительно хорошая мотивация',
	'hui_na': 'Вот тебе и а',
	'gop': 'Нормально разговаривай э',
	'cookie': 'Печенюхи',
	'low_iq1': 'соболезную',
	'low_iq2': 'а я знал что тупым везет',
	'pasol_nahui': 'pasol nahui'

}

ach_bonus_exp = {
	'amogus': 500,
	'blm': 500,
	'sus_dance': 1500,
	'free_time': 0,
	'ucraine': 100,
	'biba': 100,
	'pupa': 300,
	'net_pidor': 0,
	'pidor_full': 1500,
	'da_pizda': 0,
	'cenz': 0,
	'russian_game': 250,
	'hikki': 400,
	'money_1': 1500,
	'money_2': 1500,
	'bebra': 250,
	'anton': 100,
	'luck_casino': 100000,
	'master_lose': 0,
	'master_lose_2': 250,
	'azart_player': 900,
	'lucky_player': 1000,
	'stupid_player': 750,
	'russia_vp': 150,
	'lh_daz': 50,
	'motivate': 50,
	'gop': 50,
	'hui_na': 50,
	'cookie': 2000,
	'low_iq1': 300,
	'low_iq2': 20000,
	'pasol_nahui': 50,
}

user_colors = {
	1: 0x07ff00,
	2: 0xff5800,
	3: 0xff00a7,
	4: 0xffd400,
	5: 0x008bff,
	6: 0x0039ff,
	7: 0xa600ff,
	8: 0xff0000,
	9: 0x00ffd9,
	10: 0xf9ff00,
}

ignor_voice = [938001772918755399, 808199035034664970]